---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter.ArcReferenceType
source: html/14ebdaab-6511-6d2d-d7f8-6e44b6dec2c6.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter.ArcReferenceType Property

The choice of rule for measuring the diameter.

## Syntax (C#)
```csharp
public RebarShapeArcReferenceType ArcReferenceType { get; }
```